# Module 8: Pandas Mastery üêº

NumPy is fast, but it doesn't have column names.
**Pandas** is built on top of NumPy. It gives you **DataFrames** (like Excel tables, but on steroids).

This is the **Main Event** for Data Engineers.

---

## 1. Creating DataFrames
Usually, we read from CSV/Parquet, but we can create them manually.

In [1]:
import pandas as pd

data = {
    "name": ["Alice", "Bob", "Charlie", "David"],
    "role": ["Admin", "User", "User", "Admin"],
    "salary": [80000, 50000, 60000, 90000]
}

df = pd.DataFrame(data)
display(df)

      name   role  salary
0    Alice  Admin   80000
1      Bob   User   50000
2  Charlie   User   60000
3    David  Admin   90000

## 2. Inspecting Data
First thing you do with a new dataset.

In [2]:
print("--- Head (First 5 rows) ---")
print(df.head(2))

print("\n--- Info (Schema & Nulls) ---")
print(df.info())

--- Head (First 5 rows) ---
    name   role  salary
0  Alice  Admin   80000
1    Bob   User   50000

--- Info (Schema & Nulls) ---
<class 'pandas.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      str
 1   role    4 non-null      str
 2   salary  4 non-null      int64
dtypes: int64(1), str(2)
memory usage: 228.0 bytes
None

## 3. Filtering (Like SQL WHERE)
Select rows based on conditions.

In [3]:
# Get only Admins with salary > 85k
high_paid_admins = df[(df["role"] == "Admin") & (df["salary"] > 85000)]
display(high_paid_admins)

    name   role  salary
3  David  Admin   90000

## 4. GroupBy (Like SQL GROUP BY)
Calculate statistics per group.

In [4]:
# Average salary per Role
avg_salary_df = df.groupby("role")["salary"].mean()
display(avg_salary_df)

role
Admin    85000.0
User     55000.0
Name: salary, dtype: float64

## 5. Modifications (Adding Columns)
Vectorized operations again!

In [5]:
# Add a 'bonus' column (10% of salary)
df["bonus"] = df["salary"] * 0.10
display(df)

      name   role  salary   bonus
0    Alice  Admin   80000  8000.0
1      Bob   User   50000  5000.0
2  Charlie   User   60000  6000.0
3    David  Admin   90000  9000.0

---
# üõ†Ô∏è PRACTICE TIME
Real Data Engineering Task.

### Task 1: The Dataset
1. Run the cell below to create the dataset `orders`.
2. Filter for orders from "USA".
3. Keep only columns `order_id` and `amount`.
4. Print the result.

In [ ]:
import ctypes
# DATA SETUP (Run this first)
orders_data = {
    "order_id": [101, 102, 103, 104, 105],
    "country": ["USA", "Canada", "USA", "UK", "USA"],
    "amount": [200, 150, 450, 300, 50]
}
orders = pd.DataFrame(orders_data)

# TODO: Write your code here to filter USA orders
print(orders[orders['country'] == "USA"][["order_id","amount"]])

   order_id  amount
0       101     200
2       103     450
4       105      50

### Task 2: Aggregation
1. Calculate the **Total Amount** (sum) of money for each **Country**.
2. Sort the result by amount descending.

In [20]:
# TODO: Write your code here
orders.groupby('country')['amount'].sum().sort_values(ascending=False)

country
USA       700
UK        300
Canada    150
Name: amount, dtype: int64